[Survived] Regex
src/attachment.ts:47:10
-     .regex(/^[0-9a-f]{64}$/, {
+     .regex(/[0-9a-f]{64}$/, {
Ran all tests for this mutant.

[Survived] Regex
src/attachment.ts:47:10
-     .regex(/^[0-9a-f]{64}$/, {
+     .regex(/^[0-9a-f]{64}/, {
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/blockPatch.ts:16:12
-     z.object({ where: z.literal('start') }),
+     z.object({}),
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/blockPatch.ts:17:12
-     z.object({ where: z.literal('end') }),
+     z.object({}),
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/blockPatch.ts:18:12
-     z.object({ where: z.literal('before'), siblingBlockId: z.string() }),
+     z.object({}),
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/blockPatch.ts:19:12
-     z.object({ where: z.literal('after'), siblingBlockId: z.string() }),
+     z.object({}),
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/blockPatch.ts:40:45
-   export const InsertBlockOpSchema = z.object({
-     op: z.literal('block.insert'),
-     blockId: UlidSchema,
-     parentBlockId: UlidSchema.nullable(),
-     orderKey: z.string().optional(),
-     place: PlaceSchema.optional(),
-     blockType: z.string(),
-     content: z.unknown(),
-     meta: BlockMetaSchema.optional(),
-   });
+   export const InsertBlockOpSchema = z.object({});
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/blockPatch.ts:56:45
-   export const UpdateBlockOpSchema = z.object({
-     op: z.literal('block.update'),
-     blockId: UlidSchema,
-     patch: z.object({
-       blockType: z.string().optional(),
-       content: z.unknown().optional(),
-       meta: BlockMetaSchema.optional(),
-     }),
-   });
+   export const UpdateBlockOpSchema = z.object({});
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/blockPatch.ts:71:43
-   export const MoveBlockOpSchema = z.object({
-     op: z.literal('block.move'),
-     blockId: UlidSchema,
-     newParentBlockId: UlidSchema.nullable(),
-     orderKey: z.string().optional(),
-     place: PlaceSchema.optional(),
-     subtree: z.literal(true).optional(),
-   });
+   export const MoveBlockOpSchema = z.object({});
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/blockPatch.ts:85:45
-   export const DeleteBlockOpSchema = z.object({
-     op: z.literal('block.delete'),
-     blockId: UlidSchema,
-     subtree: z.literal(true).optional(),
-   });
+   export const DeleteBlockOpSchema = z.object({});
Ran all tests for this mutant.

[Survived] Regex
src/calendar.ts:23:27
-       const dateOnlyRegex = /^\d{4}-\d{2}-\d{2}$/;
+       const dateOnlyRegex = /\d{4}-\d{2}-\d{2}$/;
Tests ran:
    CalendarDateInfoSchema validates all-day event with only startDate
    CalendarDateInfoSchema validates all-day event with startDate and endDate
    CalendarDateInfoSchema validates timed event with startDate datetime
  and 27 more tests!

[Survived] Regex
src/calendar.ts:23:27
-       const dateOnlyRegex = /^\d{4}-\d{2}-\d{2}$/;
+       const dateOnlyRegex = /^\d{4}-\d{2}-\d{2}/;
Tests ran:
    CalendarDateInfoSchema validates all-day event with only startDate
    CalendarDateInfoSchema validates all-day event with startDate and endDate
    CalendarDateInfoSchema validates timed event with startDate datetime
  and 27 more tests!

[Survived] ObjectLiteral
src/calendar.ts:32:3
-     {
-       message: 'Date must be in YYYY-MM-DD or ISO 8601 datetime format',
-     }
+     {}
Ran all tests for this mutant.

[NoCoverage] BlockStatement
src/errors.ts:161:68
-   export function notFoundAttachment(attachmentId: string): ApiError {
-     return {
-       apiVersion: 'v1',
-       code: 'NOT_FOUND_ATTACHMENT',
-       message: `Attachment not found: ${attachmentId}`,
-       details: { attachmentId },
-     };
-   }
+   export function notFoundAttachment(attachmentId: string): ApiError {}

[NoCoverage] ObjectLiteral
src/errors.ts:162:10
-     return {
-       apiVersion: 'v1',
-       code: 'NOT_FOUND_ATTACHMENT',
-       message: `Attachment not found: ${attachmentId}`,
-       details: { attachmentId },
-     };
+     return {};

[NoCoverage] ObjectLiteral
src/errors.ts:166:14
-       details: { attachmentId },
+       details: {},

[NoCoverage] BlockStatement
src/errors.ts:170:77
-   export function fileTooLarge(sizeBytes: number, maxBytes: number): ApiError {
-     return {
-       apiVersion: 'v1',
-       code: 'FILE_TOO_LARGE',
-       message: `File size ${sizeBytes} bytes exceeds maximum ${maxBytes} bytes`,
-       details: { sizeBytes, maxBytes },
-     };
-   }
+   export function fileTooLarge(sizeBytes: number, maxBytes: number): ApiError {}

[NoCoverage] ObjectLiteral
src/errors.ts:171:10
-     return {
-       apiVersion: 'v1',
-       code: 'FILE_TOO_LARGE',
-       message: `File size ${sizeBytes} bytes exceeds maximum ${maxBytes} bytes`,
-       details: { sizeBytes, maxBytes },
-     };
+     return {};

[NoCoverage] ObjectLiteral
src/errors.ts:175:14
-       details: { sizeBytes, maxBytes },
+       details: {},

[NoCoverage] BlockStatement
src/errors.ts:179:65
-   export function unsupportedFileType(mimeType: string): ApiError {
-     return {
-       apiVersion: 'v1',
-       code: 'UNSUPPORTED_FILE_TYPE',
-       message: `File type '${mimeType}' is not supported`,
-       details: { mimeType },
-     };
-   }
+   export function unsupportedFileType(mimeType: string): ApiError {}

[NoCoverage] ObjectLiteral
src/errors.ts:180:10
-     return {
-       apiVersion: 'v1',
-       code: 'UNSUPPORTED_FILE_TYPE',
-       message: `File type '${mimeType}' is not supported`,
-       details: { mimeType },
-     };
+     return {};

[NoCoverage] ObjectLiteral
src/errors.ts:184:14
-       details: { mimeType },
+       details: {},

[Survived] ObjectLiteral
src/notateDoc.ts:18:47
-   export const ObjectRefTargetSchema = z.object({
-     kind: z.literal('object'),
-     objectId: z.string(),
-   });
+   export const ObjectRefTargetSchema = z.object({});
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/notateDoc.ts:23:46
-   export const BlockRefTargetSchema = z.object({
-     kind: z.literal('block'),
-     objectId: z.string(),
-     blockId: z.string(),
-   });
+   export const BlockRefTargetSchema = z.object({});
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/notateDoc.ts:40:40
-   export const TextNodeSchema = z.object({
-     t: z.literal('text'),
-     text: z.string(),
-     marks: z.array(MarkSchema).optional(),
-   });
+   export const TextNodeSchema = z.object({});
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/notateDoc.ts:46:45
-   export const HardBreakNodeSchema = z.object({
-     t: z.literal('hard_break'),
-   });
+   export const HardBreakNodeSchema = z.object({});
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/notateDoc.ts:50:39
-   export const RefNodeSchema = z.object({
-     t: z.literal('ref'),
-     mode: z.enum(['link', 'embed']),
-     target: RefTargetSchema,
-     alias: z.string().optional(),
-   });
+   export const RefNodeSchema = z.object({});
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/notateDoc.ts:57:39
-   export const TagNodeSchema = z.object({
-     t: z.literal('tag'),
-     value: z.string(),
-   });
+   export const TagNodeSchema = z.object({});
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/notateDoc.ts:62:46
-   export const MathInlineNodeSchema = z.object({
-     t: z.literal('math_inline'),
-     latex: z.string(),
-   });
+   export const MathInlineNodeSchema = z.object({});
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/notateDoc.ts:67:47
-   export const FootnoteRefNodeSchema = z.object({
-     t: z.literal('footnote_ref'),
-     key: z.string(),
-   });
+   export const FootnoteRefNodeSchema = z.object({});
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/notateDoc.ts:85:40
-   export const LinkNodeSchema = z.object({
-     t: z.literal('link'),
-     href: z.string(),
-     children: z.array(NonLinkInlineNodeSchema),
-   });
+   export const LinkNodeSchema = z.object({});
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/object.ts:63:51
-   export const UpdateObjectRequestSchema = z.object({
-     objectId: z.string().length(26), // ULID
-     /** Optional optimistic concurrency check */
-     baseDocVersion: z.number().int().nonnegative().optional(),
-     /** Partial updates - only provided fields are changed */
-     patch: z.object({
-       title: z.string().min(1).optional(),
-       typeKey: z.string().optional(), // Change object type
-       properties: z.record(z.unknown()).optional(), // Partial property updates
-     }),
-     /**
-      * Property mapping for type changes.
-      * Maps old property keys to new property keys.
-      * Example: { "email": "contact_email" }
-      */
-     propertyMapping: z.record(z.string()).optional(),
-   });
+   export const UpdateObjectRequestSchema = z.object({});
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/object.ts:70:19
-     patch: z.object({
-       title: z.string().min(1).optional(),
-       typeKey: z.string().optional(), // Change object type
-       properties: z.record(z.unknown()).optional(), // Partial property updates
-     }),
+     patch: z.object({}),
Ran all tests for this mutant.

[Survived] MethodExpression
src/object.ts:71:12
-       title: z.string().min(1).optional(),
+       title: z.string().max(1).optional(),
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/object.ts:89:38
-   const UpdatedObjectSchema = z.object({
-     id: z.string().length(26), // ULID
-     typeId: z.string().length(26), // ULID
-     typeKey: z.string(),
-     title: z.string(),
-     properties: z.record(z.unknown()),
-     docVersion: z.number().int().nonnegative(),
-     updatedAt: z.string().datetime(),
-   });
+   const UpdatedObjectSchema = z.object({});
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/object.ts:103:52
-   export const UpdateObjectResponseSchema = z.object({
-     object: UpdatedObjectSchema,
-     /** Properties that were dropped during type change (informational) */
-     droppedProperties: z.array(z.string()).optional(),
-   });
+   export const UpdateObjectResponseSchema = z.object({});
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/objectType.ts:65:33
-       .regex(/^[a-z][a-z0-9_]*$/, {
-         message:
-           'Property key must be lowercase, start with a letter, and contain only letters, numbers, and underscores',
-       }),
+       .regex(/^[a-z][a-z0-9_]*$/, {}),
Ran all tests for this mutant.

[Survived] Regex
src/objectType.ts:98:41
-   const HexColorSchema = z.string().regex(/^#[0-9A-Fa-f]{6}$/, {
+   const HexColorSchema = z.string().regex(/#[0-9A-Fa-f]{6}$/, {
Ran all tests for this mutant.

[Survived] Regex
src/objectType.ts:98:41
-   const HexColorSchema = z.string().regex(/^#[0-9A-Fa-f]{6}$/, {
+   const HexColorSchema = z.string().regex(/^#[0-9A-Fa-f]{6}/, {
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/objectType.ts:98:62
-   const HexColorSchema = z.string().regex(/^#[0-9A-Fa-f]{6}$/, {
-     message: 'Color must be a valid 6-digit hex color (e.g., #3B82F6)',
-   });
+   const HexColorSchema = z.string().regex(/^#[0-9A-Fa-f]{6}$/, {});
Ran all tests for this mutant.

[Survived] MethodExpression
src/objectType.ts:109:9
-     icon: z.string().max(64).nullable(),
+     icon: z.string().min(64).nullable(),
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/objectType.ts:142:35
-       .regex(/^[A-Z][a-zA-Z0-9]*$/, {
-         message: 'Type key must be PascalCase (start with uppercase letter)',
-       }),
+       .regex(/^[A-Z][a-zA-Z0-9]*$/, {}),
Ran all tests for this mutant.

[Survived] MethodExpression
src/objectType.ts:146:9
-     icon: z.string().max(64).optional(),
+     icon: z.string().min(64).optional(),
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/objectType.ts:191:54
-   export const ListObjectTypesOptionsSchema = z.object({
-     /** Include only built-in types */
-     builtInOnly: z.boolean().optional(),
-     /** Include only custom (non-built-in) types */
-     customOnly: z.boolean().optional(),
-   });
+   export const ListObjectTypesOptionsSchema = z.object({});
Ran all tests for this mutant.

[Survived] ArrowFunction
src/test-utils.ts:35:14
-           .map((i) => `  - ${i.path.join('.')}: ${i.message}`)
+           .map(() => undefined)
Tests ran:
    expectValid throws/fails for invalid data
    expectValid throws with descriptive error message for invalid data
    expectValid fails when required field is missing
